<?php
/**
 * Created by PhpStorm.
 * User: Admin
 * Date: 22.05.2017
 * Time: 10:52
 */
use miloschuman\highcharts\Highcharts;
?>

<h3 align="center">2017-2021 йилларда Ўзбекистон Республикасини ривожлантиришнинг бешта устувор йўналиши бўйича Ҳаракатлар стратегиясини<br>
    "Халқ билан мулоқот ва инсон манфаатлари йили"да амалга оширишга оид Давлат дастури доирасида 2017 йилда кўриладиган тадбирлар тўғрисида<br>
    МАЪЛУМОТ</h3>
<?
echo Highcharts::widget([
    'options' => [
        'title' => ['text' => 'УМУМИЙ'],
        'plotOptions' => [
            'pie' => [
                'cursor' => 'pointer',
            ],
            'allowPointSelect'=>true,
            'dataLabels' => ['enabled' => true],
            'showInLegend' => true,
        ],
        /*'tooltip'=> [
            'pointFormat'=>'{series.name}: <b>{point.percentage:.1f}%</b><b>{series.element:.1f}</b>'
        ],*/
        'series' => [
            [ // new opening bracket
                'type' => 'pie',
                'name' => 'Elements',
                'data' => [
                    ['Ўзбекистон Республикаси Қонуни лойиҳалари', 50],
                    ['Ўзбекистон Республикаси Президенти Фармони лойиҳалари', 9],
                    ['Ўзбекистон Республикаси Президенти Қарори лойиҳалари', 30],
                    ['Ўзбекистон Республикаси Вазирлар Маҳкамаси қарори лойиҳалари', 37],
                    ['Идоравий хужжат (норматив хуқуқий хужжатлар) лойиҳалари', 23],
                    ['Концепция ва стратегиялар  лойиҳалари', 5],
                    ['Комплекс чора-тадбирлар, Чора-тадбирлар, Дастурлар (тармоқ дастурлари), Йўл ҳариталари', 122],
                    ['Лойиҳаларни амалга ошириш, тегишли қарорлар ижросини таъминлаш', 37],
                    ['Таҳлилий маълумотномалар ва таклифлар', 7],
                ],
            ] // new closing bracket
        ],
    ],
]);
?>

<h4>Жами: 320 та</h4>
